<?php

$mainValues = [
    'banned' => '❌ | Я говорил тебе быть человеком, но ты не послушал, теперь ты заблокирован 😑😂',
    'customer_custome_plan_day' => "⏰| Пожалуйста, введите количество дней подписки\n💰| Стоимость каждого дня: DAY-PRICE",
    'customer_custome_plan_volume'=>"🔋| Пожалуйста, введите объем вашего сервиса в гигабайтах\n💰| Стоимость каждого гигабайта: VOLUME-PRICE",
    'customer_custome_plan_name'=>'Введите имя конфигурации (используйте буквы латинского алфавита и цифры)',
    'send_user_id'=>"🀄️| Пожалуйста, отправьте числовой идентификатор пользователя:",
    'enter_decrease_amount'=>"💸 | Введите сумму, которую вы хотите вычесть:",
    'enter_increase_amount'=>"💸 | Введите сумму, которую вы хотите добавить:",
    'user_not_found'=>"🥴 | Не могу найти такого пользователя, возможно, вы ошиблись",
    'amount_decreased_from_your_wallet'=> "✅ Сумма AMOUNT руб. вычтена из вашего счета",
    'amount_decreased_from_user_wallet'=>"✅ Сумма AMOUNT руб. вычтена из кошелька указанного пользователя",
    'increase_wallet_cart_to_cart'=>"♻️ Дорогой друг, отправьте мне скрин чека или номер транзакции после перевода указанной Вами суммы на карту №:

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ После подтверждения вашего платежа сумма будет автоматически добавлена в ваш кошелек!",
    'order_increase_sent'=>"🥇 Ваш заказ успешно зарегистрирован.
После подтверждения будет добавлено в ваш кошелек... 💞",
    'please_send_only_image'=>"Пожалуйста, отправляйте только изображения",
    'reached_main_menu'=>"Хорошо, вернулись назад. Если у вас есть какие-либо вопросы, дайте знать 😉 | Если вы хотите выбрать одну из опций, чтобы я мог выполнять задачи

🚪 /start",
    'increase_wallet_request_message'=>"💳 Запрос на увеличение баланса

💰Сумма: PRICE руб.
🧑‍💻 Имя и фамилия : NAME
🎯 Имя пользователя : @USERNAME
🎫 Код пользователя : <code>USER-ID</code>
",
    'out_of_connection_capacity'=>'Лимит соединений исчерпан',
    'out_of_server_capacity'=>'Лимит сервера исчерпан',
    'can_create_specific_account'=> "На этом плане можно создать только AMOUNT аккаунтов",
    'buy_account_cart_to_cart'=>"♻️ Дорогой друг, отправьте мне скрин чека или номер транзакции после перевода указанной Вами суммы на карту №:

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ После подтверждения вашего платежа (ссылка на сервер) будет отправлена вам автоматически через этого бота!",
    'renew_ccount_cart_to_cart'=>"♻️ Дорогой друг, отправьте мне скрин чека или номер транзакции после перевода указанной Вами суммы на карту №:

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME",
    'order_buy_sent'=>"🛍 Ваш заказ успешно зарегистрирован.
После подтверждения будет отправлено вам... 🥳",
    'buy_custom_account_request'=>"💓 Покупка настраиваемого плана (ТИП)
    
▫️ID пользователя : USER-ID
👨‍💼 Имя пользователя : <a href='tg://user?id=USER-ID'>NAME</a>
⚡️ Имя пользователя : @USERNAME
💰 Сумма оплаты : PRICE руб.
✏️ Название услуги : REMARK
🔋 Объем услуги : VOLUME Гигабайт
⏰ Продолжительность услуги : DAYS дней",
    'buy_new_account_request'=>"❗️|💳 Покупка нового аккаунта (ТИП)

▫️ID пользователя : USER-ID
👨‍💼 Имя пользователя : NAME
⚡️ Имя пользователя : USERNAME
💰 Сумма оплаты : PRICE руб.
🚦 Сервер : SERVERNAME
✏️ Название услуги : REMARK
🔋 Объем услуги : VOLUME Гигабайт
⏰ Продолжительность услуги : DAYS дней",
    'buy_new_much_account_request'=>"❗️|💳 Покупка нового аккаунта (ТИП)

▫️ID пользователя : USER-ID
👨‍💼 Имя пользователя : NAME
⚡️ Имя пользователя : USERNAME
💰 Сумма оплаты : PRICE руб.
🏖 Количество аккаунтов : ACCOUNT-COUNT
✏️ Название услуги : REMARK",
    'invite_buy_new_account'=>"👨‍👦‍👦 Покупка (партнерская программа)

🧝‍♂️ID пользователя : USER-ID
🛡 Имя пользователя : NAME
🔖 Имя пользователя : USERNAME
💰 Сумма оплаты : PRICE руб.
🔮 Название услуги : REMARK
💮 Заказ : FILENAME",
    'renew_order_sent'=>"✅| Дорогой друг, ваш запрос успешно зарегистрирован. После проверки и продления администратор отправит вам конфигурацию. Благодарим за терпение
    
🚪 /start",
    'renew_account_request_message'=>"♻️ Продление услуги (ТИП)

▫️ID пользователя : USER-ID
👨‍💼 Имя пользователя : NAME
⚡️ Имя пользователя : USERNAME
💰 Сумма оплаты : PRICE руб.
✏️ Название услуги : REMARK
🔋 Объем услуги : VOLUME Гигабайт
⏰ Продолжительность услуги : DAYS дней",
    'increase_account_request_message'=>"⏰ Запрос на увеличение (ТИП услуги)

▫️ID пользователя : USER-ID
👨‍💼 Имя пользователя : NAME
⚡️ Имя пользователя : USERNAME
🎈 Название услуги : REMARK
🔋 ТИП увеличения : INCREASE Гигабайт/день
💰 Стоимость : PRICE руб.",
    'waiting_message'=>'⏳ Ожидание ...',
    'join_channel_message'=>"❌ Чтобы использовать бот, вы должны быть подписаны наш канал:
    
✅ После подписки нажмите кнопку 'Я подписался'

",
    'bot_is_updating'=> "🌛Робот обновляется...",
    'select_one_to_show_detail'=> ' 🔅 Выберите один из ваших сервисов, чтобы увидеть подробности:',
    'you_dont_have_config'=>'У вас нет конфигурации 🙁 Вам нужно приобрести конфигурацию',
    'no_order_found'=> "Заказ не найден",
    'config_details_message'=>"Состояние конфигурации: STATE
    
🔮 Название конфигурации : NAME

Ссылка на подключение: CONNECT-LINK

Ссылка на подписку: SUB-LINK
⁮⁮ ⁮⁮ ⁮⁮ ⁮⁮
",
    'please_wait_message'=>"🙃 | Пожалуйста, подождите",
    'send_only_number'=> "😡 | Необходимо отправлять только цифры.",
    'change_bot_settings_message'=>'🔰 Если какая-то функция не используется в боте (выключена), отключите ее!',
    'saved_successfuly'=>"✅| Успешно сохранено",
    'invited_user_joined_message'=>"😍| Поздравляю, кто-то присоединился по вашей ссылке к боту",
    'please_select_from_below_buttons'=>"🔘| Пожалуйста, используйте только кнопки ниже",
    'use_iranian_number_only'=>"🔘| Пожалуйста, используйте только иранские номера",
    'phone_confirmed'=>"✅| Ваш номер успешно подтвержден",
    'send_your_phone_number'=>"Привет, для использования бота авторизуйтесь по номеру телефона,  с помощью кнопки ниже 👇",
    'start_message'=>'Привет! Добро пожаловать в бот GhostGuardian 👻
    
Здесь Вы сможете получить доступ к мировой сети 🌎
Для проверки качества связи используйте БЕСПЛАТНЫЙ пробный период
Наши серверы обеспечивают:
✅ Качественные соединения
📡 Безопасные каналы
㊙️ Надежное шифрование
Подробнее на нашем канале: 📎 @
Задать вопрос в группе: 🆘 @


🚪 /start',
    'new_member_joined'=>"📢 | Приветствуем нового участника:

Полное имя: FULLNAME
Имя пользователя: @USERNAME
Айди пользователя: USERID

Можете отправить ему приветственное сообщение или рекламу 😍",
    "not_joine_yet"=>"Вы еще не подписаны на канал",
    'insert_discount_code'=>"🎁| Введите ваш промокод:",
    "not_valid_discount_code"=>"😔| Введенный промокод недействителен",
    'valid_discount_code'=>"✅| Промокод успешно использован. Сумма скидки: AMOUNT рублей",
'used_discount_code'=>"☑️|🎁 Промокод использован

🔰ID пользователя: USERID
👨‍💼Имя пользователя: NAME
⚡️Имя пользователя: USERNAME
🎁Промокод: DISCOUNTCODE
💰Сумма скидки: AMOUNT рублей
⁮⁮ ⁮⁮",
"send_config_uuid"=>"❗️| Пожалуйста, отправьте мне ссылку на конфигурацию или uuid, чтобы я мог предоставить вам подробную информацию 🤭",
'not_correct_text'=>"Введенный текст неверен",
'receving_information'=>"♻️ Получение данных... ",
'request_agency_message'=>"Запрос на сотрудничество

🔰ID пользователя: USERID
👨‍💼Имя пользователя: NAME
⚡️Имя пользователя: USERNAME
⁮⁮ ⁮⁮",
    'agency_request_sent'=>"Ваш запрос успешно отправлен, пожалуйста, подождите!⁮⁮ ⁮⁮",
    'agency_request_already_sent'=>"Ваш запрос уже отправлен, пожалуйста, подождите!⁮⁮ ⁮⁮",
    'agency_request_declined'=>"🥺 Ваш запрос на сотрудничество был отклонен",
    'agency_request_approved'=>"✅ Ваш запрос на сотрудничество одобрен",
    'send_agent_discount_percent' =>"Пожалуйста, введите процент скидки для этого агентства, например, 10",
    'agent_setting_message' =>" 🧚🏻‍♀️ Уважаемый агент:

Из этого раздела вы можете сделать однократную покупку или оптом, а также управлять купленными конфигурациями",
    'selling_is_off'=>"Продажи пока отключены",
    'no_server_available'=>"😔 | К сожалению, в данный момент нет активных серверов. Пожалуйста, попробуйте позже",
    'buy_sub_select_location' => '  1️⃣ Шаг 1:

Выберите местоположение сервера, из списка ниже 😊',
    'the_bot_in_not_admin' => "😡| Робот все еще не является администратором канала. Пожалуйста, добавьте его в канал и отправьте его айди.",
    'category_not_avilable'=>"В этом сервере нет доступных категорий",
    'receive_categories'=>"♻️ Получение категорий... ",
    'buy_sub_select_category'=> "2️⃣ Шаг 2:

Выберите интересующую вас категорию 🤭",
    'no_plan_available'=>"💡 В данной категории нет доступных планов",
    'receive_plans'=>"📍 Получение списка планов",
    'buy_sub_select_plan'=> "3️⃣ Шаг 3:

Выберите один из планов и перейдите к оплате 🤲 🕋", 
    'buy_custom_plan'=>'➕ Купить индивидуальный план',
    'select_one_plan_to_edit'=>"Выберите один из планов, чтобы отредактировать его", 
    'enter_account_amount' => "♻️ Введите количество запрашиваемых аккаунтов, максимум 6 за раз:


    ⚠️ | **Предупреждение:** При превышении указанного значения, вероятно, аккаунт не будет создан, и панель x-ui может зависнуть",
    'send_positive_number'=>"Пожалуйста, введите положительное число больше 0",
    'buy_subscription_detail'=>"〽️ Название плана: PLAN-NAME
        ➖➖➖➖➖➖➖
        💎 Стоимость доступа: PRICE
        ➖➖➖➖➖➖➖
        📃 Описание :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_much_subscription_detail'=>"〽️ Название плана: PLAN-NAME
        Количество аккаунтов: ACCOUNT-COUNT
        💎Стоимость доступа: PRICE
        ➖➖➖➖➖➖➖
        💎 Общая стоимость : TOTAL-PRICE
        ➖➖➖➖➖➖➖
        📃 Описание :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_custom_subscription_detail'=>"〽️ Название плана: PLAN-NAME
        Объем: VOLUME GB
        Продолжительность: DAYS дней
        ➖➖➖➖➖➖➖
        💎 Стоимость доступа : PRICE
        ➖➖➖➖➖➖➖
        📃 Описание :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    "agents_list" => "🔍 Список агентов:
    
    Для просмотра статистики продаж агентов нажмите на имя агента. Также вы можете установить процент для агента или удалить его из списка",
    'agent_deleted_successfuly'=>"Агент успешно удален",
    'agent_details'=>'🙎‍♂️ Информация об агенте AGENT-NAME
    
    Справа доход, слева количество покупок агента',
    'send_config_remark'=>"Пожалуйста, введите замечание для конфигурации",
    'forward_your_message'=>"Перешлите свое сообщение боту, пожалуйста",
    "enter_ticket_title"=>"💠 Пожалуйста, введите тему тикета!",
    "enter_ticket_description"=> "💠 Пожалуйста, отправьте текст или изображение тикета в простой и краткой форме!",
    "sent_config_to_user"=> '✅ Я отправил конфигурацию и инструкции
    Замечание: REMARK
    Объем услуги: VOLUME Гигабайт
    Продолжительность услуги: DAYS дней',
    "renewed_config_to_user"=> '✅ Я продлил конфигурацию и инструкции
    Замечание: REMARK
    Объем услуги: VOLUME Гигабайт
    Продолжительность услуги: DAYS дней',
    'sending_config_to_user'=>'🚀 | 😍 В процессе отправки конфигурации клиенту...',
    'config_not_found'=>"Произошла проблема, выполните повторно",
    'incorrect_config_name'=>"😡| Введенное имя недействительно",
    'pay_with_tron_wallet'=>"♻️ Дорогой друг, отправьте сумму AMOUNT токенов Tron на указанный кошелек и отправьте мне идентификатор транзакции:
    
    💰 <code>TRON-WALLET</code>",
    'incorrect_tax_id'=>"Введенный идентификатор оплаты недействителен",
    'used_tax_id'=>"Этот идентификатор оплаты уже использован",
    'in_review_tax_id'=>"Ваша транзакция находится на рассмотрении",
    'user_taxid_rejected'=>"Неудачная транзакция TYPE (трон)
        
    ID пользователя: USERID
    Имя: NAME
    Имя пользователя: USERNAME
    
    Идентификатор оплаты: TAXID
    
    <b>Отклонено после 5 попыток</b>",
    'your_taxid_rejected'=>"Транзакция TYPE с вашим идентификатором оплаты: TAXID
    
    <b>Отклонено после 5 попыток</b>",
    'incorrect_user_taxid_rejected'=>"Неудачная транзакция TYPE (трон)
        
    ID пользователя: USERID
    Имя: NAME
    Имя пользователя: USERNAME
    
    Идентификатор оплаты: TAXID
    
    <b>Из-за неверной регистрации транзакции отклонено</b>",
    'your_incorrect_taxid_rejected'=>"Транзакция TYPE с вашим идентификатором оплаты: TAXID
    
    <b>Из-за неверной регистрации транзакции отклонено</b>",
    'partially_paid_user_taxid'=>"Неудачная транзакция TYPE (трон)
        
    ID пользователя: USERID
    Имя: NAME
    Имя пользователя: USERNAME
    
    Идентификатор оплаты: TAXID
    

    <b>Из-за несоответствия суммы транзакции она была отклонена</b>",
    'you_have_partially_paid'=>"Транзакция TYPE с вашим идентификатором оплаты: TAXID
    
    <b>Из-за несоответствия суммы транзакции она была отклонена</b>",
    'agent_discount_settings'=>"Управление скидками агента AGENT-NAME"
    ];
    
    $buttonValues = [
        'bot_reports'=>"📉 Общая статистика бота",
        'message_to_user'=>"📞 Личное сообщение",
        'user_reports'=>"🔑 Информация о пользователе",
        'admins_list'=>"👤 Список администраторов",
        'increase_wallet'=>"💵 Пополнить баланс",
        'decrease_wallet'=>"💸 Уменьшить баланс",
        'create_account'=>"⌨️ Создать массовый аккаунт",
        'ban_user'=>"❌ Заблокировать пользователя",
        'unban_user'=>"✅ Разблокировать пользователя",
        'server_settings'=>'🚦Управление серверами и настройками',
        'categories_settings'=>'🗂 Управление категориями',
        'plan_settings'=>'🪣 Управление тарифами',
        'discount_settings'=>"🎁 Управление скидками",
        'main_button_settings'=>"🕹 Управление основными кнопками",
        'gateways_settings'=>'💳 Оплата и каналы',
        'bot_settings'=>'⚙️ Настройки бота',
        'tickets_list'=>'📪 Список обращений',
        'message_to_all'=>"📨 Отправить сообщение всем",
        'forward_to_all'=>"📨 Переслать сообщение всем",
        'back_to_main'=>'⤵️ Вернуться в главное меню',  
        'cart_to_cart'=>"💳 перевод на карту",
        'now_payment_gateway'=>"💳  NowPayment",
        'zarinpal_gateway'=> "💳  ZarinPal",
        'nextpay_gateway'=>"💳  NextPay",
        'weswap_gateway'=>"💳  Rial",
        'approve' => 'Так и быть ✅',
        'approved' => 'Так и быть ✅',
        'decline' => 'Отклонить ❌',
        'declined' => 'Отклонено ❌',
        'back_button'=> "Назад 🔙",
        'renew_connection_link'=>"🚷 Прервать соединение и создать новую ссылку",
        'update_config_connection'=>"⌛️ Обновить конфигурацию",
        'increase_config_volume'=>"🩸 Увеличить объем услуги",
        'increase_config_days'=>"📆 Увеличить срок услуги",
        'renew_config'=>'♻ Продлить услугу',
        'change_config_location'=>'🌎 Изменить местоположение',
        'selected_protocol'=>"🚦 Выбранный протокол",
        'volume_left'=>"⏳ Оставшийся объем:",
        'expire_date'=>"⏰ Дата истечения срока: ",
        'buy_date'=>"⏰ Дата покупки: ",
        'plan_name'=>" 🚀 Название плана:",
        'on'=>"Включено ✅",
        'off'=>"Выключено ❌",
        'active'=>"Активно 🟢",
        'deactive'=>"Неактивно 🔴",
        'send_phone_number'=>'☎️ Отправить номер телефона',
        'send_message_to_user'=>"✉️ Отправить сообщение пользователю ",
        'cancel' => '😪 Я передумал, не надо',
        'join_channel'=>"Присоединиться к каналу",
        'have_joined'=>"Я подписался ✅",
        'gift_volume_day'=>"🎯 Подарок в объеме и времени",
        'test_account'=>"🎁 Пробный период. БЕСПЛАТНО !",
        'invite_friends'=>"🏆 Пригласить друзей",
        'my_info'=>"🧑‍💼 Мой аккаунт",
        'my_subscriptions'=>'📱 Мои серверы',
        'buy_subscriptions'=>'🛒  Купить VPN',
        'shared_existence'=>"❕ Общий доступ ",
        'individual_existence'=>"❗️ Выделенный канал",
        'application_links'=>'🧩 Как подключить',
        'my_tickets'=>"📨 Мои обращения",
        'search_config'=>"🪫 Поиск конфигурации",
        'delete_config'=>"❌ Удалить конфигурацию",
        'pay_with_wallet' => "💰 Оплатить с баланса аккаунта",
        'request_agency' =>"🧑‍💼 Запрос сотрудничество 🧑‍💼",
        'agency_setting' =>"➰ Панель сотрудничества ➰",
        'agent_one_buy'=>"➕ Однократная покупка",
        'agent_much_buy'=>"♾ Оптовая покупка",
        'agent_bought_accounts'=>"Количество покупок",
        'agent_joined_date'=>"Дата вступления",
        'agent_agency_date'=>"Дата агентства",
        "agent_list"=>" 📍 Сотрудничество 📍",
        'search_agent_config'=>"Поиск конфигурации",
        'search_admin_config'=>"Поиск конфигурации пользователя",
        'sharj'=>"✅ 💳 Пополнить баланс аккаунта",
        "qr_config"=>"🔳 QR-код конфигурации",
        "qr_sub"=>"🔳 QR-код подписки",
        'start_bot'=>"Запустить бота",
        'enable_config'=>"Включить конфигурацию",
        'disable_config'=>"Отключить конфигурацию",
        "tron_gateway"=>"Tron",
        "youkassa_gateway"=>"YouMoney", 
        'plan_discount'=>"На тариф",
        'server_discount'=>"На сервер"
    ];
    
?>
